# Image Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComboBoxMember..::..Image Property
ComboBoxMember Class See Also
---
The image shown on the ComboBoxMember.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ImageSource Image { get; set; }
```

Visual Basic
---
```text
Public Property Image As ImageSource
	Get
	Set
```

Visual C++
---
```text
public:
property ImageSource^ Image {
	ImageSource^ get ();
	void set (ImageSource^ value);
}
```

# Remarks
The image will be shown on the left side of the item. The best size is 16 x 16 pixels.
# See Also
ComboBoxMember Class
Autodesk.Revit.UI Namespace